In [2]:
%%javascript
IPython.Cell.options_default.cm_config.lineNumbers = true

In [3]:
# Charge ma feuille de style pour nbviewer
from IPython.core.display import display, HTML
from  urllib.request import urlopen
# import urllib.request, urllib.parse, urllib.error

url='https://github.com/debimax/cours-debimax/raw/master/static/custom.css'
with urlopen(url) as response:
    styles = response.read().decode("utf8")
styles="<style>\n{}\n</style>".format(styles)
HTML(styles)

# Bases de données

## Généralité sur les bases de données

### Le langage SQL et les bases de données

La ***base de données (BDD)*** est un système qui enregistre des informations. Ces informations sont toujours classées. On peut donc faire des recherches sur ces données.  
Les ***SGBD (Systèmes de Gestion de Bases de Données)*** sont les programmes qui se chargent du stockage de vos données.

Les plus connus sont :  
- MySQL : libre et gratuit, c’est probablement le SGBD le plus connu.
- PostgreSQL : libre et gratuit comme MySQL, avec plus de fonctionnalités mais un peu
moins connu ;
- SQLite : libre et gratuit, très léger et adapté pour des petites bases de donnée ;
- Oracle : utilisé par les très grosses entreprises ;

Vous donnez les ordres au SGBD en langage ***SQL (Structured Query Language)***.  
Voici un exemple de commande en langage SQL, pour vous donner une idée :

```python
SELECT id, auteur, message, datemsg FROM livreor ORDER BY datemsg DESC
```

Pour communiquer avec une base de donnée (créer, modifier, faire une requête) on le fait avec:  
- **un logiciel:** sqlitebrowser pour sqlite, pgadmin pour postgree.
- **php :** phpmyadmin pour mysql ou phppgadmin pour postgree.
- **python :** (import sqlite3) , il y a aussi des modules pour mysql et postgree.

## Structure d’une base de données

Avec les bases de données, il faut utiliser un vocabulaire précis.  
Une table est représentée sous la forme d’un tableau ; par exemple, le tableau suivante vous montre à quoi peut ressembler le contenu d’une table appelée << eleve >>.


id | nom | prénom | classe | date_naissance | LV1 | LV2 
 :-: | :-: | :-: | :-: |:-: | :-: |:-: 
1 | AREZ |  Michael | TS2 | 1995  | anglais | espagnol
2  | ASSONG  | Yasmine  |  TS3  | 1995 | anglais  | espagnol

## Lire les bases de données


Télécharger les deux bases de donnée suivantes:  
- [isn.sqlite3](http://megamaths.free.fr/pdf/bases/isn.sqlite3)
- [communes.sqlite3](http://megamaths.free.fr/pdf/bases/communes.sqlite3)

Créer le dossier ***documents***  et mettre les bases de données dans ce dossier.  



### Avec un logiciel sqlitebrowser

Ouvrez sqlitebrowser : Menu&#8594;Développement&#8594;SQLite database browser  
Ouvrer alors la base *isn.sqlite3*, cliquer alors sur l’onglet *browse data* pour voir la base.  
On peut bien sur modifier les entrées, en ajouter et enlever.  

### Avec python
Dans le shell python executez le code suivant  (le chemin de la base est biensur à adapter chez vous).

In [79]:
import sqlite3          # import du module
con = sqlite3.connect('documents/isn.sqlite3')      # ouverture de la base
c = con.cursor()        # obtention d'un curseur
c.execute("SELECT * FROM sqlite_master") # la requête
c.fetchall()     #fetch signifie récupérer en anglais

[('table',
  'eleves',
  'eleves',
  3,
  'CREATE TABLE eleves (id INTEGER PRIMARY KEY, nom TEXT, prenom TEXT, classe TEXT, annee_naissance NUMERIC, LV1 , LV2 )')]

La même requète mais en une seule ligne

In [81]:
c.execute("SELECT * FROM sqlite_master").fetchall()

[('table',
  'eleves',
  'eleves',
  3,
  'CREATE TABLE eleves (id INTEGER PRIMARY KEY, nom TEXT, prenom TEXT, classe TEXT, annee_naissance NUMERIC, LV1 , LV2 )')]

In [86]:
c.execute("SELECT * FROM eleves").fetchall()[:5] # pour voir toute la table, [:5] pour les 5 premiers

[(1, 'ACHARD', 'Quentin', 'TS3', 1995, 'anglais', 'espagnol'),
 (2, 'AREZKI', 'Yasmine', 'TS2', 1995, 'anglais', 'espagnol'),
 (3, 'ASSING', 'Michael', 'TS3', 1995, 'anglais', 'espagnol'),
 (4, 'BAILLUS', ' Anthony', 'TS3', 1995, 'anglais', 'espagnol'),
 (5, 'BELLEZZA-BERGER', 'Anaïs', 'TS3', 1995, 'anglais', 'espagnol')]

On utilise des bases de données pour effectuer des ***requêtes*** et avoir rapidement un résultat.

In [92]:
# Par exemple pour afficher tous les champs des élèves de TS3
c.execute("SELECT * FROM eleves WHERE classe='TS3'").fetchall()[:10]

[(1, 'ACHARD', 'Quentin', 'TS3', 1995, 'anglais', 'espagnol'),
 (3, 'ASSING', 'Michael', 'TS3', 1995, 'anglais', 'espagnol'),
 (4, 'BAILLUS', ' Anthony', 'TS3', 1995, 'anglais', 'espagnol'),
 (5, 'BELLEZZA-BERGER', 'Anaïs', 'TS3', 1995, 'anglais', 'espagnol'),
 (6, 'BEN AZOUZ', 'Nassim', 'TS3', 1994, 'anglais', 'espagnol'),
 (14, 'BROCHENIN', 'Léna', 'TS3', 1995, 'anglais', 'espagnol'),
 (22, 'CHASANE', 'Mélanie', 'TS3', 1995, 'anglais', 'espagnol'),
 (27, 'DE LA VAISSIERE', 'Arnaud', 'TS3', 1994, 'anglais', 'espagnol'),
 (30, 'DERMECHE', 'linda', 'TS3', 1995, 'anglais', 'espagnol'),
 (34, 'DINH', 'Nicolas', 'TS3', 1994, 'anglais', 'espagnol')]

In [91]:
# On affiche seulement le champs  nom et  prenom
c.execute("SELECT nom, prenom FROM eleves WHERE classe='TS3'").fetchall()[:10]

[('ACHARD', 'Quentin'),
 ('ASSING', 'Michael'),
 ('BAILLUS', ' Anthony'),
 ('BELLEZZA-BERGER', 'Anaïs'),
 ('BEN AZOUZ', 'Nassim'),
 ('BROCHENIN', 'Léna'),
 ('CHASANE', 'Mélanie'),
 ('DE LA VAISSIERE', 'Arnaud'),
 ('DERMECHE', 'linda'),
 ('DINH', 'Nicolas')]

In [90]:
# tous les champs des élèves de TS3 classés par année de naissance
c.execute("SELECT * FROM eleves WHERE classe='TS3' ORDER BY annee_naissance").fetchall()[:10]

[(6, 'BEN AZOUZ', 'Nassim', 'TS3', 1994, 'anglais', 'espagnol'),
 (27, 'DE LA VAISSIERE', 'Arnaud', 'TS3', 1994, 'anglais', 'espagnol'),
 (34, 'DINH', 'Nicolas', 'TS3', 1994, 'anglais', 'espagnol'),
 (40, 'FERRAZI', 'Elsa', 'TS3', 1994, 'anglais', 'espagnol'),
 (47, 'GONZALEZ', 'Simon', 'TS3', 1994, 'anglais', 'espagnol'),
 (49, 'GRAS', 'Jérémy', 'TS3', 1994, 'anglais', 'espagnol'),
 (56, 'JACQUET', 'Laura', 'TS3', 1994, 'anglais', 'espagnol'),
 (64, 'MAHOUR BACHA', 'Hanène', 'TS3', 1994, 'anglais', 'espagnol'),
 (71, 'MERLIN', 'Alexis', 'TS3', 1994, 'anglais', 'espagnol'),
 (75, 'MORA', 'Quentin', 'TS3', 1994, 'anglais', 'italien')]

In [94]:
# tous les champs des élèves de TS3 classés par l'id
c.execute("SELECT * FROM eleves WHERE classe='TS3' ORDER BY id").fetchall()[:10]

[(1, 'ACHARD', 'Quentin', 'TS3', 1995, 'anglais', 'espagnol'),
 (3, 'ASSING', 'Michael', 'TS3', 1995, 'anglais', 'espagnol'),
 (4, 'BAILLUS', ' Anthony', 'TS3', 1995, 'anglais', 'espagnol'),
 (5, 'BELLEZZA-BERGER', 'Anaïs', 'TS3', 1995, 'anglais', 'espagnol'),
 (6, 'BEN AZOUZ', 'Nassim', 'TS3', 1994, 'anglais', 'espagnol'),
 (14, 'BROCHENIN', 'Léna', 'TS3', 1995, 'anglais', 'espagnol'),
 (22, 'CHASANE', 'Mélanie', 'TS3', 1995, 'anglais', 'espagnol'),
 (27, 'DE LA VAISSIERE', 'Arnaud', 'TS3', 1994, 'anglais', 'espagnol'),
 (30, 'DERMECHE', 'linda', 'TS3', 1995, 'anglais', 'espagnol'),
 (34, 'DINH', 'Nicolas', 'TS3', 1994, 'anglais', 'espagnol')]

In [95]:
c.execute("SELECT * FROM eleves WHERE ( prenom = 'Quentin' ) ").fetchall()

[(1, 'ACHARD', 'Quentin', 'TS3', 1995, 'anglais', 'espagnol'),
 (75, 'MORA', 'Quentin', 'TS3', 1994, 'anglais', 'italien')]

In [96]:
c.execute("SELECT * FROM eleves WHERE ( nom = 'ACHARD' AND prenom = 'Quentin' ) ").fetchall()

[(1, 'ACHARD', 'Quentin', 'TS3', 1995, 'anglais', 'espagnol')]

In [97]:
c.execute("SELECT * FROM eleves WHERE nom LIKE 's%' ").fetchall()

[(93, 'SAJIDE', 'Soufiane', 'TS3', 1994, 'anglais', 'espagnol'),
 (94, 'SOUQUE', 'Julie', 'TS3', 1995, 'anglais', 'espagnol')]

On peut bien sur modifier une base de donnée

In [75]:
#pour ajouter
c.execute("INSERT INTO eleves (nom, prenom, classe,annee_naissance) VALUES ('Simpson', 'bart', 'TS3', 1995)")
con.commit() # pour valider l'écriture de la base
c.execute("SELECT * FROM eleves").fetchall()[-5:]

[(96, 'TISSIER VERSE', 'Eva', 'TS2', 1994, 'anglais', 'italien'),
 (97, 'TOURNE', ' Louna', 'TS1', 1995, 'anglais', 'espagnol'),
 (98, 'TRINH', 'Van Thibaut', 'TS3', 1995, 'anglais', 'espagnol'),
 (99, 'VERGHADE', 'Jérémy', 'TS2', 1995, 'anglais', 'espagnol'),
 (100, 'Simpson', 'bart', 'TS3', 1995, None, None)]

In [76]:
# pour modifier
c.execute("UPDATE eleves SET prenom='lisa' WHERE nom='Simpson' AND prenom='bart'")
con.commit()
c.execute("SELECT * FROM eleves").fetchall()[-5:]

[(96, 'TISSIER VERSE', 'Eva', 'TS2', 1994, 'anglais', 'italien'),
 (97, 'TOURNE', ' Louna', 'TS1', 1995, 'anglais', 'espagnol'),
 (98, 'TRINH', 'Van Thibaut', 'TS3', 1995, 'anglais', 'espagnol'),
 (99, 'VERGHADE', 'Jérémy', 'TS2', 1995, 'anglais', 'espagnol'),
 (100, 'Simpson', 'lisa', 'TS3', 1995, None, None)]

In [77]:
# effacer
c.execute("DELETE FROM eleves WHERE nom='Simpson'") # tous les simpson seront effacés
con.commit()
c.execute("SELECT * FROM eleves").fetchall()[-5:]

[(95, 'THIZY', ' Kévin', 'TS1', 1995, 'anglais', 'espagnol'),
 (96, 'TISSIER VERSE', 'Eva', 'TS2', 1994, 'anglais', 'italien'),
 (97, 'TOURNE', ' Louna', 'TS1', 1995, 'anglais', 'espagnol'),
 (98, 'TRINH', 'Van Thibaut', 'TS3', 1995, 'anglais', 'espagnol'),
 (99, 'VERGHADE', 'Jérémy', 'TS2', 1995, 'anglais', 'espagnol')]

## Exercices 

***Exercice 1** Les communes en France communes.sqlite3*

La base de donnée *communes.sqlite3* se trouve dans le dossier documents.  
Cette table porte sur les communes en france ref : (IGN)

id | code_comm |  insee_com | nom_comm | statut | x_chf_lieu | y_chf_lieu  | x_centroid  | y_centroid  
  :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---:  
1 | '271' | '29271' | 'SAINT-VOUGAY' | 'Commune simple' | 1743 | 68564 | 1737 |  65559  


z_moyen |superficie |population | code_cant |  code_arr | code_dept | nom_dept | code_reg| nom_region  
 :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---:| :---:  
 88 | 1483 |  0.9 | '31' | '3' | '29'  | 'FINISTERE' |  '53' |  'BRETAGNE'

In [1]:
import sqlite3 # import du module
# ouverture de la base
con = sqlite3.connect('documents/communes.sqlite3')
# obtention d'un curseur
c = con.cursor()
c.execute("SELECT * FROM sqlite_master").fetchall() # la requête

[('table',
  'communes',
  'communes',
  3,
  'CREATE TABLE communes (id INTEGER PRIMARY KEY, code_comm VARCHAR, insee_com VARCHAR, nom_comm VARCHAR, statut VARCHAR, x_chf_lieu INTEGER, y_chf_lieu INTEGER, x_centroid INTEGER, y_centroid INTEGER, z_moyen INTEGER, superficie INTEGER, population FLOAT, code_cant VARCHAR, code_arr VARCHAR, code_dept VARCHAR, nom_dept VARCHAR, code_reg VARCHAR, nom_region VARCHAR)')]

 À l'aide de ***python*** et ***sqlite3*** répondez aux questions suivantes :
 
***1\.*** Quelles sont les caractéristiques de la communes qui a pour id 586 ?

c.execute("SELECT * FROM ........... ").fetchall()

***2\.*** La liste des régions

In [ ]:
c.execute("SELECT DISTINCT  ... FROM  ... ").fetchall()

***3\.*** Obtenez de même la liste  La liste des régions  classée par ordre alphabétique.

In [ ]:
c.execute("SELECT DISTINCT ... FROM  ...  ORDER BY ... ").fetchall()

***4\.*** Donner le nom des villes des sous prefectures de la région Picardie.

***5\.*** Combien y a t il de communes en france ?

***6\.*** Combien y a t il de Sous-préfecture dans ma base de donnée ?

***7\.*** Combien y a t il de communes dans le département de l’isère ?

***8\.*** Combien y a t il de communes dans le département de l’isère entre 10 000 habitants et 20 000 habitants ?

***9\.*** Les 3 communes de l’isère qui ont la plus grande superficie.

***10\.*** Citer les 10 communes les plus peuplés dans le département de l’isère.

***11\.*** Les 10 les moins peuplés.

***12\.*** Le nombre de communes en france dont le nom commence par “Gren“

***13\.*** Le nom des communes du département de l’isère dont le nom commence par “Gre“

## Résumé des commande sql

### Obtention des données

```SQL
SELECT <liste des noms de colonnes> FROM <liste des noms de tables>
SELECT  * FROM tab1                      #toutes les colonnes
SELECT  col1,col3 FROM tab1              #une partie des colonnes
SELECT  DISTINCT col1 FROM tab1          #élimine les doublons
SELECT  nom AS "nom personne" FROM tab1  #renommage des colonnes
SELECT  nom "nom personne" FROM tab1     #Oracle : mot clé AS facultatif
```

### Expression des restrictions

```SQL
SELECT * FROM tab1 WHERE <condition(s)>
SELECT * FROM tab1 WHERE ville IN ('Brest ','Rennes ','Paris ')
SELECT * FROM tab1 WHERE age NOT BETWEEN 15 AND 20
SELECT * FROM tab1 WHERE travail IS NULL
SELECT * FROM tab1 WHERE travail IS NOT NULL
```

```sql
> >= < <= = <>         #comparateur arithmétiques
AND OR NOT             #comparateur logique
%                      #n’importe quelle séquence de car.
_                      #n’importe quel caractère
```

### Tri et présentation des résultats

```SQL
SELECT * FROM tab1 ORDER BY col1                #tri ascendant par défaut
SELECT * FROM tab1 ORDER BY col5,col7           #tri par col5 puis tri par col7
SELECT * FROM tab1 ORDER BY age ASC, sexe DESC  #ASC ascendant,  DESC descendant
```

### Expression des jointures

```SQL
SELECT * FROM tab1,tab2       #jointure sans qualification =  produit cartésien  
SELECT * FROM tab1,tab2 WHERE tab1.col1=tab2.col2    #jointure avec égalité = équijointure  
SELECT * FROM tab1 t1,tab2 t2,tab3 t3 WHERE t1.col1=t2.col2 AND t2.col2=t3.col3   #jointures en cascades
```

### Expression des manipulations de données

```SQL
SELECT designation,prix*1.196 AS "P. TTC" FROM tab1 YEAR, MONTH, DATE     #date
SUBSTRING, UPPER, LOWER, CHARACTER_LENGTH    #manipulation de chaînes de car.
```


### Les fonctions statistiques

```SQL
AVG     #moyenne
COUNT   #nombre d éléments
MAX     #maximum
MIN     #minimum
SUM     #somme

SELECT COUNT(*)FROM tab1
SELECT SUM(col1) FROM tab2
```

### Regroupements


```SQL
SELECT * FROM tab1 GROUP BY col1
```

### Sous-requêtes SQL


```SQL
SELECT * FROM tab1 WHERE prix > (SELECT MIN(prix) FROM tab2)
SELECT * FROM tab1 WHERE nom NOT IN (SELECT nom FROM tab2)
SELECT * FROM tab1 WHERE prix > ALL (SELECT prix FROM tab2)  #sup. à ttes les valeurs
SELECT * FROM tab1 WHERE prix > ANY (SELECT prix FROM tab2)  #sup. à au moins 1
```

### Opérateurs ensemblistes

S'intercalent entre deux sélections

```SQL
UNION
INTERSECT
EXCEPT
```


### Insertions

```SQL
INSERT INTO tab1 VALUES ('abc',5,7)          #toutes les valeurs doivent être renseignées
INSERT INTO tab1(col1,col7) VALUES ('abc',7) #on ne renseigne que les colonnes indiquées, les cols non précisées sont mises à NULL)
INSERT INTO tab1 SELECT * FROM tab2
```

###  Mises à jour
```SQL
UPDATE tab1 SET col7='abc' WHERE col1=1
```

### Suppressions

```SQL
DELETE FROM tab1 WHERE col1=1
DELETE FROM tab1 WHERE col1 IN (SELECT no FROM tab2)
DELETE FROM tab1          #vide complètement la table
```

## Aide mémoire 

[Ref](http://sql.sh/ressources/document/mysql-aide-memoire-sql.pdf)